asig/amigaclock/esp32_firmware/sdkconfig.defaults
# ---- Target ----
CONFIG_IDF_TARGET="esp32s3"

# ---- Flash / PSRAM (GUITION/Sunton ESP32-4848S040: 16MB flash, octal PSRAM) ----
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# ---- Partition table with enough app space (LVGL + BLE stack are not tiny) ----
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# ---- FreeRTOS tick rate, smoother LVGL timing ----
CONFIG_FREERTOS_HZ=1000

# ---- Bluetooth: NimBLE (lighter than Bluedroid, all we need for a GATT peripheral) ----
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=n

# ---- LVGL (managed component) ----
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_COLOR_16_SWAP=y
CONFIG_LV_MEM_CUSTOM=y
CONFIG_LV_MEMCPY_MEMSET_STD=y
CONFIG_LV_USE_LOG=y
